Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: If an Apple event handler has been registered for the event specified by event Class and event ID, removes it.
ja: あるアップルイベントハンドラーがevent Classとevent IDで指定されるイベントに対して登録されているならば、それを取り除きます。

source: If an app makes frequent use of this unit, you can extend Unit Speed to add a furlongs Per Fortnight class method for convenient access as follows:
ja: あるアプリがこの単位を頻繁に使うようならば、あなたはUnit Speedを拡張して、furlongs Per Fortnightクラスメソッドを加えることが便利なアクセスのために行えます、次のように：

source: If an error occurs and the original item is not in the original location or a temporary location, the resulting error object contains a user info dictionary with the key "NSFile Original Item Location Key".
ja: エラーが発生するそして元の項目が元の場所や一時的場所にないならば、結果のエラーオブジェクトはキー"NSFile Original Item Location Key"をもつユーザ情報辞書を含みます。

source: If an error occurs during the creation of the backup item, the operation fails.
ja: バックアップ項目の作成の間にエラーが発生するならば、操作は失敗します。

source: If an error occurs, this property contains an object that describes the error; otherwise, it is set to nil.
ja: エラーが発生するならば、このプロパティはエラーを記述するオブジェクトを含みます；そうでなければ、それはnilに設定されます。

source: If an error occurs, upon return contains an NSError object that describes the problem.
ja: エラーが発生するならば、戻りでは、問題を記述するNSErrorオブジェクト。

source: If an event handler is already registered for the specified event class and event ID, removes it.
ja: あるイベントハンドラーが、指定のイベントクラスとイベントIDに対して既に登録されるならば、それを取り除きます。

source: If an exact match is not possible, and requested with the strict option, nil is passed to the closure and the enumeration ends.
ja: 厳密な合致が可能でない、そしてstrictオプションで要請されるならば、nilがクロージャに渡されます、そして列挙は終わります。

source: If an extension is provided the subdirectories are not searched.
ja: 拡張子が提供されるならば、下位ディレクトリは調査されません。

source: If an item with the same name already exists at dst Path, this method stops the move attempt and returns an appropriate error.
ja: 同じ名前を持つ項目が既にdst Pathで存在するならば、このメソッドは移動の試みを停止して、適切なエラーを返します。

source: If an item with the same name already exists at dst URL, this method stops the move attempt and returns an appropriate error.
ja: 同じ名前を持つ項目が既にdst URLで存在するならば、このメソッドは移動の試みを停止して、適切なエラーを返します。

source: If an object implements (or inherits) this method, and returns a non-nil (and non-self) result, that returned object is used as the new receiver object and the message dispatch resumes to that new object.
ja: あるオブジェクトがこのメソッドを実装（または継承）するならば、そして非nil（および非self）の結果を返すならば、その返されるオブジェクトが新しいレシーバ（受け取り手）オブジェクトとして使われます、そしてメッセージ発送はその新しいオブジェクトに対して再び始まります。

source: If any change fails, returns false, but it is undefined whether any changes actually occurred.
ja: 何らかの変更が失敗するならば、falseを返します、しかし何らかの変更が実際に生じたかどうかははっきりしません。

source: If any file wrapper in the directory doesn’t have a preferred filename, its preferred name is automatically set to its corresponding key in the children By Preferred Name dictionary.
ja: ディレクトリの中のどれかのファイルラッパーが優先ファイル名を持たないならば、それの優先名は自動的にchildren By Preferred Name辞書の中のそれの対応するキーに設定されます。

source: If both the start dates and the durations are equal, then the intervals are considered equal and .Ordered Same is returned as the result.
ja: 開始日と間隔が両方とも等しいならば、そのとき間隔は等しいとみなされて、.Ordered Sameが結果として返されます。

source: If closure throws error while sorting, order of elements may change.
ja: クロージャがソートの間にエラーをスローするならば、要素の順番は変化するでしょう。

source: If conversion is successful, upon return contains the object created from string.
ja: 変換が成功するならば、戻りではstringから作成されるオブジェクトを含みます。

source: If iCloud is unavailable for any reason or there is no logged-in user, the value of this property is nil.
ja: iCloudが何らかの理由で利用可能でないまたはログインしたユーザがいないならば、このプロパティの値はnilです。

source: If invoked from a subclass, the result will be that class or nil.
ja: サブクラスから発動したならば、結果はそのクラスまたはnilでしょう。

source: If it is necessary to swap the bytes of x, this function calls NSSwap Double(_:) to perform the swap.
ja: xのバイトをスワップする必要があるならば、この関数はNSSwap Double(_:)を呼び出すことでスワップを実行します。

source: If it is necessary to swap the bytes of x, this function calls NSSwap Float(_:) to perform the swap.
ja: xのバイトをスワップする必要があるならば、この関数はNSSwap Float(_:)を呼び出してスワップを実行します。

source: If it is necessary to swap the bytes of x, this function calls NSSwap Int(_:) to perform the swap.
ja: xのバイトをスワップする必要があるならば、この関数はNSSwap Int(_:)を呼び出してスワップを実行します。

source: If it is necessary to swap the bytes of x, this function calls NSSwap Long(_:) to perform the swap.
ja: xのバイトをスワップする必要があるならば、この関数はNSSwap Long(_:)を呼び出してスワップを実行します。

source: If it is necessary to swap the bytes of x, this function calls NSSwap Long Long(_:) to perform the swap.
ja: xのバイトをスワップする必要があるならば、この関数はNSSwap Long Long(_:)を呼び出してスワップを実行します。

source: If it is necessary to swap the bytes of x, this function calls NSSwap Short(_:) to perform the swap.
ja: xのバイトをスワップする必要があるならば、この関数はNSSwap Short(_:)を呼び出してスワップを実行します。

source: If it is necessary to swap the bytes, this function calls NSSwap Double(_:) to perform the swap.
ja: バイトをスワップする必要があるならば、この関数はNSSwap Double(_:)を呼び出すことでスワップを実行します。

source: If it is necessary to swap the bytes, this function calls NSSwap Float(_:) to perform the swap.
ja: バイトをスワップする必要があるならば、この関数はNSSwap Float(_:)を呼び出してスワップを実行します。

source: If it is necessary to swap the bytes, this function calls NSSwap Int(_:) to perform the swap.
ja: バイトをスワップする必要があるならば、この関数はNSSwap Int(_:)を呼び出してスワップを実行します。

source: If it is necessary to swap the bytes, this function calls NSSwap Long(_:) to perform the swap.
ja: バイトをスワップする必要があるならば、この関数はNSSwap Long(_:)を呼び出してスワップを実行します。

source: If it is necessary to swap the bytes, this function calls NSSwap Long Long(_:) to perform the swap.
ja: バイトをスワップする必要があるならば、この関数はNSSwap Long Long(_:)を呼び出してスワップを実行します。

source: If it is necessary to swap the bytes, this function calls NSSwap Short(_:) to perform the swap.
ja: バイトをスワップする必要があるならば、この関数はNSSwap Short(_:)を呼び出してスワップを実行します。

source: If it isn’t, return nil; but if it is of the right class, return a properly formatted and, if necessary, localized string.
ja: それがそうでないならば、nilを返してください；しかしそれが正しいクラスならば、適切に書式設定されたそして、必要ならば、ローカライズされた文字列を返してください。

source: If localized resources were searched first, the bundle object might waste time searching for a nonexistent localized resource before returning the global resource.
ja: ローカライズされたリソースが最初に検索されたならば、バンドルオブジェクトは、グローバルリソースを返す前に、存在しないローカライズリソースを検索する時間を浪費するかもしれません。

source: If more than one appropriate directory exists in the specified domain, this method returns only the first one it finds.
ja: 複数の適したディレクトリが指定された領域に存在するならば、このメソッドは、それが見つけた最初のもののみを返します。

source: If mutated, this calendar will no longer track the user’s preferred calendar.
ja: もし変化したならば、このカレンダーはもはやユーザの持つ優先カレンダーを追跡しません。

source: If neither of the objects implements the appropriate method, Cocoa falls back on similar comparison operators in the protocol NSComparisonMethods (but again, only for the operations is equal, is less than or equal, is less than, is greater than or equal, or is greater than).
ja: オブジェクトのどちらも適切なメソッドを実装しないならば、CocoaはプロトコルNSComparisonMethodsの中の似たような比較演算に依頼します（しかしふたたび、is equal, is less than or equal、is less than、is greater than or equal、またはis greater thanに対してだけ）。

source: If neither of the special options report Progress or report Completion is specified, then the result argument to the Block is guaranteed to be non-nil, and as mentioned before, it is guaranteed to have a valid overall range.
ja: 特別なオプションreport Progressまたはreport Completionのどちらも指定されないならば、「ブロック」に対する結果引数は、nilにならないことを保証されます、そして前に言及されたように、それは有効な全体的な範囲を持つと保証されます。

source: If no elements in the collection match belongs In Second Partition, the returned index is equal to the collection’s end Index.
ja: コレクションの中の要素が１つもbelongs In Second Partitionに一致しないならば、返されるインデックスはコレクションのend Indexと等しいです。

source: If no elements in the collection satisfy the given predicate, returns nil.
ja: コレクションの要素が与えられた述部を満たすことがないならば、nilを返します。

source: If no error occurred, this parameter is left unmodified.
ja: エラーが生じなかったならば、このパラメータは修正されないままです。

source: If no new file system object is required, the URL object in this parameter may be the same passed to the original Item URL parameter.
ja: 新しいファイルシステムオブジェクトが必要とされないならば、このパラメータの中のURLオブジェクトはoriginal Item URLパラメータに渡されたものと同じであるかもしれません。

source: If no objects in the array pass the test, returns NSNot Found.
ja: 配列の中にテストを合格するオブジェクトが１つもないならば、NSNot Foundを返します。

source: If no objects in the array pass the test, returns an empty index set.
ja: 配列の中にテストを合格するオブジェクトが１つもないならば、空のインデックス集合を返します。

source: If no such object is found, returns nil.
ja: そのようなオブジェクトが見つけられないならば、nilを返します。

source: If no such time exists, the next available time is returned (which could, for example, be in a different day than the nominal target date).
ja: そのような時間が存在しないならば、次の利用可能な時間が返されます（それは例えば、名目上の目標日付とは別の日である可能性があります）。

source: If no such time exists, the next available time is returned (which could, for example, be in a different day, week, month, … than the nominal target date).
ja: そのような時間が存在しないならば、次の利用可能な時間が返されます（それは例えば、名目上の目標日付とは別の日、週、月、...である可能性があります）。

source: If no version has been set, the default is 0.
ja: バージョンが設定されていないならば、初期状態では0です。

source: If nodes in the corresponding directory on the file system have been added or removed, corresponding file wrappers are released or created as needed.
ja: ファイルシステム上の対応するディレクトリの中のノードが加えられたまたは削除されたならば、対応するファイルラッパーは解放されるまたは必要に応じて作成されます。

source: If non-nil, if there is a error during the conversion, upon return contains an NSString object that describes the problem.
ja: 非nilならば、変換の間にエラーがあるならば、戻りでは問題を記述するNSStringオブジェクトを返します。

source: If non-nil, if validation fails contains an NSString object that describes the problem.
ja: 非nilならば、検証失敗ならば問題を記述するNSStringオブジェクトを含みます。

source: If none of the objects in the array is equal to an Object, returns NSNot Found.
ja: 配列の中のオブジェクトにan Objectと同等なものが１つもないならば、NSNot Foundを返します。

source: If none of the objects in the array is identical to an Object, returns NSNot Found.
ja: 配列の中のオブジェクトにan Objectと同一なものが１つもないならば、NSNot Foundを返します。

source: If none of the objects within range is equal to an Object, returns NSNot Found.
ja: range中のオブジェクトにan Objectと同等なものが１つもないならば、NSNot Foundを返します。

source: If none of the objects within range is identical to an Object, returns NSNot Found.
ja: range中のオブジェクトにan Objectと同一なものが１つもないならば、NSNot Foundを返します。

source: If none of the user-preferred localizations are available, this method returns one of the values in localizations Array.
ja: ユーザ環境設定のローカライゼーションのうちのどれも利用可能でないならば、このメソッドはlocalizations Arrayの中の値の１つを返します。

source: If none require different comparison methods, you can implement only the methods you need from NSScripting Comparison Methods.
ja: 異なる比較メソッドを必要としないならば、あなたはNSScripting Comparison Methodsからあなたが必要とするメソッドのみを実装できます。

source: If none were encountered, the function returns NSCalculation No Error.
ja: 何も出くわさなかったならば、関数はNSCalculation No Errorを返します。

source: If not successful, returns false after setting out Error to an NSError object that describes the reason why the file wrapper could not be reread.
ja: 成功しないならば、falseを、out Error to an NSErrorオブジェクトを設定する後に返します、それはなぜファイルラッパーが再読み込みされることができなかったのか理由を記述します。

source: If not successful, returns false after setting out Error to an NSError object that describes the reason why the file wrapper’s contents could not be written.
ja: 成功しないならば、falseを、out Error to an NSErrorオブジェクトを設定する後に返します、それはなぜファイルラッパーの持つ内容が書き出されることができなかったのか理由を記述します。

source: If one of the rectangles has 0 (or negative) width or height, a copy of the other rectangle is returned; but if both have 0 (or negative) width or height, the returned rectangle has its origin at (0.0, 0.0) and has 0 width and height.
ja: 一方の矩形が０（または負）の幅または高さを持つならば、他方の矩形のコピーが返されます；しかし両方が０（または負）の幅または高さを持つならば、返される矩形はそれの起点 (0.0, 0.0) と０の幅と高さを持ちます。

source: If one range is completely contained in the other, the returned range is equal to the larger range.
ja: 一方の範囲が完全に他方の中に含まれるならば、返される範囲は大きい方の範囲です。

source: If overridden, this parameter should contain a description of any errors that occur.
ja: オーバーライドされるならば、このパラメータは出現する何らかのエラーの記述を含むべきです。

source: If overridden, this parameter should contain the object created from the provided string.
ja: オーバーライドされるならば、このパラメータは提供された文字列から作成されるオブジェクトを含まなくてはなりません。

source: If provided, the name used to create a backup of the original item.
ja: 提供されるならば、元の項目のバックアップを作成するのに使われる名前。

source: If reading with both options succeeds, then subsequent invocations of the methods listed in the comment for the NSFile Wrapper Reading Immediate reading option to the receiver and all its descendant file wrappers will never fail.
ja: 両方のオプションを持つ読み出しが成功するならば、そのときNSFile Wrapper Reading Immediate読み出しオプションのためのコメントで一覧にされるメソッドの、その後のレシーバおよび全てのそれの子孫ラッパーへの発動は、決して失敗しないでしょう。

source: If reading with this option succeeds, then subsequent uses of file Wrappers, regular File Contents, symbolic Link Destination URL, and serialized Representation sent to the file wrapper and all its child file wrappers will fail and return nil only if an actual error occurs (for example, the volume has disappeared or the file server is unreachable)—not as a result of the user moving or deleting files.
ja: このオプションでの読み出しがうまくいくならば、そのときその後のファイルラッパーとすべてのそれの子ファイルラッパーに送られるfile Wrappers、regular File Contents、symbolic Link Destination URL、そしてserialized Representationの利用は失敗します、そして実際にエラーが発生する（例えば、ボリュームが見えなくなるまたはファイルサーバが到達不能である）場合にのみnilを返します — ユーザがファイルを移動または削除する結果ではなく。

source: If set to true and includes Count is set to false, no count is displayed.
ja: trueに設定してincludes Countがfalseに設定されるならば、計数は表示されません。

source: If set to true and includes Unit is set to false, no unit is displayed.
ja: trueに設定してincludes Unitがfalseに設定されるならば、単位は表示されません。

source: If set to true, kilocalorie may be represented using “C” instead of “kcal”.
ja: trueに設定するならば、kilocalorieは “C” を使って表されるかもしれません、“kcal” ではなく。

source: If set, a "." in a pattern will match a line terminator in the input text.
ja: 設定されるならば、パターン中の「.」は入力されたテキストで行終止にマッチします。

source: If set, allow use of white space and #comments within patterns
ja: 設定されるならば、パターンの範囲内で空白と#commentsの使用を許します

source: If set, matching will take place in a case-insensitive manner.
ja: 設定されるならば、マッチングは大文字と小文字の区別をしない方法で発生します。

source: If set, word boundaries are found according to the definitions of word found in Unicode UAX 29, Text Boundaries.
ja: 設定されるならば、語境界はUnicode UAX 29: Text Boundaries（テキスト境界）で見つけられる語の定義によって見つけられます。

source: If specified, and there is no matching time before the end of the next instance of the next higher component to the highest specified component in the Date Components argument, the method will return the next existing value of the missing component and preserves the lower components’ values (e.g., no 2:37am results in 3:37am, if that exists).
ja: もし指定される、そしてDate Components引数の中の最も高位の指定された構成要素に対して次に高位の構成要素の次のインスタンスの最後の前に合致する時刻がないならば、このメソッドはその見つからない構成要素の次の現存する値を返して、そして低位の構成要素の値をそのままにするでしょう（例えば、2:37amなしでは結果は3:37am、それが存在するならば）。

source: If specified, the algorithm travels as far forward or backward as necessary looking for a match.
ja: 指定されるならば、アルゴリズムは合致するものを探す必要がある限りずっと前方または後方に進みます。

source: If the first Equal option is also specified, returns the lowest index of equal objects.
ja: first Equalオプションも同時に指定されるならば、いくつかの同等オブジェクトのうちの最も低いインデックスが返ります。

source: If the insertion Index option is not specified:
ja: insertion Indexオプションが指定されないならば：

source: If the insertion Index option is specified, returns the index at which you should insert obj in order to maintain a sorted array:
ja: insertion Indexオプションが指定されるならば、あなたがソートされた配列を整備する目的でobjを挿入すべきところのインデックスを返します：

source: If the last Equal option is also specified, returns the highest index of equal objects.
ja: last Equalオプションも同時に指定されるならば、いくつかの同等オブジェクトのうちの最も高いインデックスが返ります。

source: If the report Completion matching option is specified, the Block object will be called once after matching is complete, with nil result and the completed matching flag is set in the flags passed to the Block, plus any additional relevant NSRegular Expression .Matching Flags from among hit End, required End, or internal Error.
ja: report Completionマッチング・オプションが指定されるならば、「ブロック」オブジェクトがマッチングが完了した後に一度だけ呼ばれます、nilの結果とcompletedマッチングフラグが「ブロック」に渡されるflagsにおいて設定されると、何らかの追加の関連したNSRegular Expression .Matching Flagsをhit End、required End、またはinternal Errorの中から加えます。

source: If the report Progress matching option is specified, the Block will also be called periodically during long-running match operations, with nil result and progress matching flag set in the Block’s flags parameter, at which point the client may again stop the operation by setting the contents of stop to true.
ja: report Progressマッチング・オプションが指定されるならば、「ブロック」はまた長く実行されているマッチ操作の間に定期的に呼ばれることもします、そしてnilの結果でそしてprogressマッチングフラグが「ブロック」のflagsパラメータにおいて設定されると、その時点でクライアントはstopの内容をtrueに設定することによって再び操作を止めることができます。

source: If the obj is found and neither first Equal nor last Equal is specified, returns an arbitrary matching object's index.
ja: objが見つけられてfirst Equalもlast Equalも指定されないならば、随意の合致しているオブジェクトのインデックスが返ります。

source: If the obj is found and neither first Equal nor last Equal is specified, returns any equal or one larger index than any matching object’s index.
ja: objが見つけられてfirst Equalもlast Equalも指定されないならば、何らかの合致しているオブジェクトに等しいかより大きい何らかのインデックスが返ります。

source: If the STDERR_FILENO file descriptor has been redirected away from the default or is going to a tty, it will also be written there.
ja: STDERR_FILENOファイル記述子が初期状態から離れてリダイレクトされたまたはttyに向かっているならば、それは同様にそこに書き込まれます。

source: If the calendar property is set, that is used rather than the receiving calendar, and if both the calendar and time Zone are set, the time Zone property value overrides the time zone of the calendar property.
ja: calendarプロパティが設定されるならば、受け手側のカレンダーではなくてそれが使われます、そしてcalendarとtime Zoneの両方が設定されるならば、time Zoneプロパティ値がcalendarプロパティのタイムゾーンをオーバーライドします。

source: If the opts bit mask specifies reverse order, then the last item that matches is returned.
ja: optsビットマスクが逆順を指定するならば、そのときは合致する最後の項目が返されます。

source: If the Block parameter is nil this method will raise an exception.
ja: 「ブロック」パラメータがnilならばこのメソッドは例外を引き起こすでしょう。

source: If the URL specifies a directory, the contents of that directory are recursively removed.
ja: URLがディレクトリを指定するならば、そのディレクトリの内容は再帰的に除去されます。

source: If the allocation fails, raises NSInvalid Argument Exception.
ja: アロケートが失敗するならば、NSInvalid Argument Exceptionが引き起こされます。

source: If the application is sandboxed, then the script must be in the application Scripts Directory folder.
ja: アプリケーションがサンドボックスであるならば、そのときスクリプトはapplication Scripts Directoryフォルダの中になければなりません。

source: If the array is empty, returns nil.
ja: 配列が空ならば、nilを返します。

source: If the array is not sorted, the result is undefined.
ja: 配列がソートされていないならば、結果は未定義です。

source: If the behavior you want to add supplements that of the existing class, you could write a category on NSArray.
ja: あなたが望む挙動が既存のクラスのそれの補遺を追加する場合、あなたはNSArray上でカテゴリを書くことができます。

source: If the block parameter is nil this method will raise an exception.
ja: 「ブロック」パラメータがnilならばこのメソッドは例外を引き起こすでしょう。

source: If the block parameter or index Set is nil this method will raise an exception.
ja: この「ブロック」パラメータまたはindex Setがnilならばこのメソッドは例外を引き起こすでしょう。

source: If the block parameter or the index Set is nil this method will raise an exception.
ja: 「ブロック」パラメータまたはこのindex Setがnilならばこのメソッドは例外を引き起こすでしょう。

source: If the bundle encounters errors in loading or if it can’t find the executable code file in the bundle directory, this property is nil.
ja: バンドルがロードしている間にエラーに直面するならば、またはそれがバンドルディレクトリ中に実行可能コードファイルを見つけられないならば、このプロパティはnilを返します。

source: If the bundle’s executable code is not yet loaded, this method dynamically loads it into memory.
ja: バンドルの持つ実行可能コードがまだロードされないならば、このメソッドは動的にそれをメモリにロードします。

source: If the call to replace Subrange simply appends the contents of new Elements to the collection, the complexity is O(n), where n is the length of new Elements.
ja: replace Subrangeへの呼び出しが単にnew Elementsの内容をコレクションに追加するだけならば、計算量はO(n)です、ここでnはnew Elementsの長さです。

source: If the capacity specified in capacity is greater than four memory pages in size, this may round the amount of requested memory up to the nearest full page.
ja: capacityの中の指定された容量がサイズの中の４メモリページより大きいならば、これは要求されたメモリの総量を最寄りのフルページまで切り上げるかもしれません。

source: If the collection does not have sufficient capacity for another element, additional storage is allocated before appending new Element.
ja: コレクションが別の要素に対して十分な容量を持たないならば、追加のストレージがnew Elementを追加する前に割り当てられます。

source: If the collection is empty, the value of this property is nil.
ja: コレクションが空であるならば、このプロパティはnilです。

source: If the component already has that value, this may result in a date which is the same as the given date.
ja: 構成要素が既にその値を持つならば、これはその与えられた日付と同じ日付という結果になるでしょう。

source: If the cookie has no port list this method returns nil and the cookie will be sent to any port.
ja: クッキーがポートリストを持たないならばこのメソッドはnilを返します、そしてクッキーはポートに送られます。

source: If the count of the range is greater than Memory Layout Type>.stride * buffer .count then only the first N bytes will be copied into the buffer.Precondition: The range must be within the bounds of the data.
ja: 範囲の総数がMemory Layout Type>.stride * buffer .countより大きいならば、そのとき最初のNバイトだけがバッファにコピーされます。前提条件：範囲はデータの境界内でなければなりません。

source: If the current working directory is not accessible for any reason, the value of this property is nil.
ja: 現在の作業ディレクトリが何らかの理由でアクセス可能でないならば、このプロパティの値はnilです。

source: If the data is not valid JSON, this method throws the data Corrupted error.
ja: データが有効なJSONでないならば、このメソッドはdata Corruptedエラーをスローします。

source: If the date and time difference cannot be adequately displayed, the formatter displays one date value.
ja: 日付と時刻の差が満足に表示されることができないならば、フォーマッタは１つの日付値を表示します。

source: If the date is earlier than the current date and time, this property’s value is negative.
ja: 日付が現在の日付と時刻より早いならば、このプロパティの値は負です。

source: If the date object is earlier than the current date and time, this property’s value is negative.
ja: 日付オブジェクトが現在の日付と時刻より早いならば、このプロパティの値は負です。

source: If the delegate method returns true, or if the delegate does not implement the appropriate methods, the file manager proceeds to remove the file or directory.
ja: 委任先メソッドがtrueを返すならば、または委任先が適切なメソッドを実装しないならば、ファイルマネージャがファイルまたはディレクトリの除去を続行します。

source: If the delegate method returns true, or if the delegate does not implement the appropriate methods, the file manager copies the given file or directory.
ja: 委任先メソッドがtrueを返すならば、または委任先が適切なメソッドを実装しないならば、ファイルマネージャは与えられたファイルまたはディレクトリをコピーします。

source: If the delegate method returns true, or if the delegate does not implement the appropriate methods, the file manager creates the hard link.
ja: 委任先メソッドがtrueを返すならば、または委任先が適切なメソッドを実装しないならば、ファイルマネージャはハードリンクを作成します。

source: If the delegate method returns true, or if the delegate does not implement the appropriate methods, the file manager moves the file.
ja: 委任先メソッドがtrueを返すならば、または委任先が適切なメソッドを実装しないならば、ファイルマネージャはファイルを移動します。

source: If the delegate method returns true, or if the delegate does not implement the appropriate methods, the file manager proceeds to copy the file or directory.
ja: 委任先メソッドがtrueを返すならば、または委任先が適切なメソッドを実装しないならば、ファイルマネージャがファイルまたはディレクトリのコピーを続行します。

source: If the delegate stops the operation for a file, this method returns true.
ja: 委任先が、ファイルに対する操作を停止するならば、このメソッドはtrueを返します。

source: If the directory contains no entries, this method returns an empty array.
ja: ディレクトリが登録項目を含まないならば、このメソッドは空の配列を返します。

source: If the domain does not start with a dot, then the cookie is only sent to the exact host specified by the domain.
ja: ドメインがドットで始まらないならば、その時クッキーはドメインによって指定される正確なホストにのみ送られます。

source: If the domain does start with a dot, then the cookie is sent to other hosts in that domain as well, subject to certain restrictions.
ja: ドメインがドットで始まるならば、その時クッキーは、特定の制約を条件として、そのドメインの中の他のホストにも同様に送られます。
